In [1]:
import pandas as pd

In [2]:
WMT_df = pd.read_csv("WMT.csv")

In [3]:
WMT_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2010-01-01,53.740002,55.200001,52.509998,53.430000,41.107609,291591500
1,2010-02-01,53.619999,54.500000,52.660000,54.070000,41.599998,278505000
2,2010-03-01,54.040001,56.270000,53.150002,55.599998,42.777157,270764400
3,2010-04-01,55.750000,55.900002,53.520000,53.639999,41.501411,282951100
4,2010-05-01,53.880001,54.950001,50.000000,50.560001,39.118404,398119000

In [4]:
WMT_df = WMT_df.rename(columns = {'Adj Close': 'WMT'})
WMT_df.head()

,Date,Open,High,Low,Close,WMT,Volume
0,2010-01-01,53.740002,55.200001,52.509998,53.430000,41.107609,291591500
1,2010-02-01,53.619999,54.500000,52.660000,54.070000,41.599998,278505000
2,2010-03-01,54.040001,56.270000,53.150002,55.599998,42.777157,270764400
3,2010-04-01,55.750000,55.900002,53.520000,53.639999,41.501411,282951100
4,2010-05-01,53.880001,54.950001,50.000000,50.560001,39.118404,398119000

In [5]:
WMT_clean = WMT_df[['Date','WMT']]
WMT_clean.head()

         Date        WMT
0  2010-01-01  41.107609
1  2010-02-01  41.599998
2  2010-03-01  42.777157
3  2010-04-01  41.501411
4  2010-05-01  39.118404

In [6]:
len(WMT_clean)

120

In [7]:
len(WMT_clean.dropna())

120